In [113]:
import pandas as pd
import numpy as np

In [137]:
# Missing data
df_missed = pd.read_csv('datasets/4/missed_data.csv')
df_missed.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
2  100003000.0     NaN  LEXINGTON           No    not given       NaN     1
3  100004000.0   201.0   BERKELEY          NaN            1       NaN   700
4          NaN   203.0   BERKELEY            Y         NAN/       2.0  1600

In [138]:
df_missed

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON           No    not given       NaN     1
3  100004000.0   201.0    BERKELEY          NaN            1       NaN   700
4          NaN   203.0    BERKELEY            Y         NAN/       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN       HURLEY     950.0   NaN
7  100008000.0   213.0     TREMONT            Y            1       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

In [115]:
# Проверь параметры в документации
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
df_missed_2 = pd.read_csv('datasets/4/missed_data.csv', na_values={'NUM_BEDROOMS': 'not given'}, true_values=['Y', 'y'], false_values=['N', 'No'])
df_missed_2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM         True            3       1.0  1000
1  100002000.0   197.0   LEXINGTON        False            3       1.5    --
2  100003000.0     NaN   LEXINGTON        False          NaN       NaN     1
3  100004000.0   201.0    BERKELEY          NaN            1       NaN   700
4          NaN   203.0    BERKELEY         True         NAN/       2.0  1600
5  100006000.0   207.0    BERKELEY         True          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN       HURLEY     950.0   NaN
7  100008000.0   213.0     TREMONT         True            1       1.0   NaN
8  100009000.0   215.0     TREMONT         True           na       2.0  1800

In [116]:
# Что такое NaN?
pd.isna([None, 0, pd.NA, pd.NaT, np.NaN, np.Inf, np.NAN])

array([ True, False,  True,  True,  True, False,  True])

In [117]:
name_mappings = {'ST_NUM': 'Street NO', 'ST_NAME': 'Street Name'}
# Можно менять названия индексам (index=...)
df_missed_2 = df_missed_2.rename(columns=name_mappings)
df_missed_2

,PID,Street NO,Street Name,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,True,3,1.0,1000
1,100002000.0,197.0,LEXINGTON,False,3,1.5,--
2,100003000.0,NaN,LEXINGTON,False,NaN,NaN,1
3,100004000.0,201.0,BERKELEY,NaN,1,NaN,700
4,NaN,203.0,BERKELEY,True,NAN/,2.0,1600
5,100006000.0,207.0,BERKELEY,True,NaN,1.0,800
6,100007000.0,NaN,WASHINGTON,NaN,HURLEY,950.0,NaN
7,100008000.0,213.0,TREMONT,True,1,1.0,NaN
8,100009000.0,215.0,TREMONT,True,na,2.0,1800

In [118]:
# errors{‘ignore’, ‘raise’, ‘coerce’}, default ‘raise’
#   If ‘raise’, then invalid parsing will raise an exception.
#   If ‘coerce’, then invalid parsing will be set as NaN.
#   If ‘ignore’, then invalid parsing will return the input.

num_columns = ['NUM_BEDROOMS', 'NUM_BATH']
df_missed_2[num_columns] = df_missed_2[num_columns].applymap(lambda value: pd.to_numeric(value, errors='coerce'))
df_missed_2

,PID,Street NO,Street Name,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,True,3.0,1.0,1000
1,100002000.0,197.0,LEXINGTON,False,3.0,1.5,--
2,100003000.0,NaN,LEXINGTON,False,NaN,NaN,1
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700
4,NaN,203.0,BERKELEY,True,NaN,2.0,1600
5,100006000.0,207.0,BERKELEY,True,NaN,1.0,800
6,100007000.0,NaN,WASHINGTON,NaN,NaN,950.0,NaN
7,100008000.0,213.0,TREMONT,True,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,True,NaN,2.0,1800

In [120]:
# Некрасиво:
# df_missed_2['SQ_FT'] = pd.to_numeric(df_missed_2['SQ_FT'], errors='coerce')
# df_missed_2

# Красиво: 
df_missed_2_args = {'SQ_FT': pd.to_numeric(df_missed_2['SQ_FT'], errors='coerce')}
df_missed_2.assign(**df_missed_2_args)
# OR 
# df_missed_2.assign(SQ_FT=pd.to_numeric(df_missed_2['SQ_FT'], errors='coerce'))

,PID,Street NO,Street Name,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,True,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,False,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,False,NaN,NaN,1.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,True,NaN,2.0,1600.0
5,100006000.0,207.0,BERKELEY,True,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,NaN,950.0,NaN
7,100008000.0,213.0,TREMONT,True,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,True,NaN,2.0,1800.0

In [126]:
# inplace=True - Не создает новый объект, а меняет текущий
df_missed_2.dropna(subset=['PID'], axis=0, inplace=True)
# df_missed_2.dropna(axis=1)
# df_missed_2.dropna(axis=0)

,PID,Street NO,Street Name,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,True,3.0,1.0,1000
1,100002000.0,197.0,LEXINGTON,False,3.0,1.5,--

In [136]:
df_missed_3 = pd.read_csv('datasets/4/missed_data.csv', na_values={'NUM_BEDROOMS': 'not given'}, true_values=['Y', 'y'], false_values=['N', 'No'])
df_missed_3

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM         True            3       1.0  1000
1  100002000.0   197.0   LEXINGTON        False            3       1.5    --
2  100003000.0     NaN   LEXINGTON        False          NaN       NaN     1
3  100004000.0   201.0    BERKELEY          NaN            1       NaN   700
4          NaN   203.0    BERKELEY         True         NAN/       2.0  1600
5  100006000.0   207.0    BERKELEY         True          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN       HURLEY     950.0   NaN
7  100008000.0   213.0     TREMONT         True            1       1.0   NaN
8  100009000.0   215.0     TREMONT         True           na       2.0  1800

In [135]:
num_columns_missed_3 = ['NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']
df_missed_3.rename(columns=name_mappings)\
    .assign(**{key: pd.to_numeric(df_missed_3['SQ_FT'], errors='coerce') for key in num_columns_missed_3})\
    .dropna(subset=['PID'])

,PID,Street NO,Street Name,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,True,1000.0,1000.0,1000.0
1,100002000.0,197.0,LEXINGTON,False,NaN,NaN,NaN
2,100003000.0,NaN,LEXINGTON,False,1.0,1.0,1.0
3,100004000.0,201.0,BERKELEY,NaN,700.0,700.0,700.0
5,100006000.0,207.0,BERKELEY,True,800.0,800.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,NaN,NaN,NaN
7,100008000.0,213.0,TREMONT,True,NaN,NaN,NaN
8,100009000.0,215.0,TREMONT,True,1800.0,1800.0,1800.0